{
    "manual_info": {
        "title": "Manual Completo de Usuario | TasasAlD铆a Business VIP",
        "version": "3.0 F茅nix",
        "last_update": "Febrero 2026",
        "compliance": "PDA Compliance Checked"
    },
    "welcome_message": "Bienvenido al futuro de la gesti贸n financiera inteligente. Este manual es tu mapa para dominar TasasAlD铆a y blindar tu negocio contra la volatilidad.",
    "sections": [
        {
            "id": "activation",
            "title": " Primeros Pasos: Activaci贸n",
            "steps": [
                "Acepta los T茅rminos y Condiciones deslizando hasta el final.",
                "IMPORTANTE: El Modo Demo es de uso 煤nico (24h). No reactivable.",
                "Copia tu ID de Instalaci贸n (Formato: TASAS-XXXX).",
                "Solicita tu C贸digo de Activaci贸n al soporte VIP.",
                "Ingresa el c贸digo (Formato: ACTIV-XXXX-XXXX) y valida."
            ]
        },
        {
            "id": "section_1",
            "title": " Secci贸n 1: Monitor de Mercado",
            "description": "Tu torre de control con el pulso econ贸mico en tiempo real.",
            "features": [
                {
                    "name": "Indicadores Principales",
                    "details": "Tasa BCV (Oficial), Tasa USDT (Paralelo P2P) y Euro BCV."
                },
                {
                    "name": "La Brecha (%)",
                    "details": "Diferencia porcentual entre BCV y Paralelo. Si sube, protege tus precios."
                },
                {
                    "name": "Indicadores de Tendencia",
                    "details": "Flechas y colores (Verde/Rojo) que indican variaciones recientes en las tasas."
                },
                {
                    "name": "Modo Kiosco",
                    "details": "Bot贸n de 'Pantalla Completa' para exhibir la tasa en grande en tu local."
                },
                {
                    "name": "Captura de Pantalla",
                    "details": "Icono de c谩mara en Modo Kiosco para guardar una imagen compartible de la tasa del d铆a."
                }
            ]
        },
        {
            "id": "section_2",
            "title": "М Secci贸n 2: Calculadora y Chat IA",
            "description": "Calculadora h铆brida con modos Manual y Chat Inteligente.",
            "features": [
                {
                    "name": "Modo Manual",
                    "details": "Calculadora tradicional. Selecciona USD o VES, ingresa monto y elige la tasa (BCV, Paralelo, Promedio)."
                },
                {
                    "name": "Mister Cambio (Asistente IA)",
                    "details": "Habla o escribe en lenguaje natural. Ej: '50 d贸lares a bolos' o 'Precio de 2 harinas'."
                },
                {
                    "name": "Control de Voz",
                    "details": "Activa/Desactiva la respuesta de voz tocando el 铆cono de micr贸fono/altavoz en la cabecera de la calculadora."
                },
                {
                    "name": "Tarjetas de Respuesta",
                    "details": "Resultados visuales grandes con bot贸n de copiar r谩pido."
                }
            ]
        },
        {
            "id": "section_3",
            "title": " Secci贸n 3: Cat谩logo 'Blindado'",
            "description": "Inventario que ajusta precios en Bol铆vares autom谩ticamente.",
            "features": [
                {
                    "name": "Precios en D贸lares Fijos",
                    "details": "Fijas el precio en USD una vez. La app calcula los Bs diarios seg煤n la tasa."
                },
                {
                    "name": "Calibraci贸n de Efectivo",
                    "details": "Herramienta 'Calibrar Tasa Efectivo' para ajustar la paridad del d贸lar f铆sico vs USDT."
                },
                {
                    "name": "Cotizaciones Flash",
                    "details": "Selecciona productos -> Ver Pedido -> Cotizar por WhatsApp. Genera un mensaje listo para enviar."
                }
            ]
        },
        {
            "id": "section_4",
            "title": " Secci贸n 4: Billetera (Mis Cuentas)",
            "description": "Gestiona tus datos de pago para compartir r谩pido.",
            "features": [
                {
                    "name": "Gesti贸n de Cuentas",
                    "details": "Guarda Pago M贸vil, Transferencias, Zelle y Binance."
                },
                {
                    "name": "Compartir Datos",
                    "details": "Env铆a tus datos bancarios por WhatsApp o muestra un c贸digo QR generado al instante."
                },
                {
                    "name": "Calculadora de Cobro",
                    "details": "Al compartir, puedes agregar un monto en Bs y la app calcula el equivalente en divisas (si aplica)."
                }
            ]
        },
        {
            "id": "section_5",
            "title": " Secci贸n 5: Configuraci贸n y Datos",
            "features": [
                {
                    "name": "Tema",
                    "details": "Alterna entre Modo Claro y Oscuro con el 铆cono de sol/luna."
                },
                {
                    "name": "Respaldo (Backup)",
                    "details": "En el 铆cono de engranaje (Cat谩logo), puedes Exportar e Importar todos tus productos y cuentas."
                },
                {
                    "name": "Modo Offline",
                    "details": "Funciona sin internet mostrando la 煤ltima tasa guardada (alerta visual de datos antiguos)."
                }
            ]
        }
    ],
    "tips": [
        "Usa el micr贸fono en horas pico para conversiones r谩pidas.",
        "Comparte tu lista de precios actualizada cada ma帽ana desde el Cat谩logo.",
        "Realiza un respaldo semanal de tus datos desde configuraci贸n.",
        "Usa la Calibraci贸n de Efectivo para no perder dinero aceptando d贸lares f铆sicos."
    ]
}